run/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    overset
    {
        type            overset;
        value           uniform 0;
    }

	inlet1
	{
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.03;
        value       	uniform 0.1;  
	}

	outlet
	{
        type            inletOutlet;
		inletValue		$internalField;
		value			$internalField;
    }

    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    movingObstacle
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

	frontAndBack
    {
        type            empty;
    }
	
}

// ************************************************************************* //
