run/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    overset
    {
        type            overset;
        value           uniform 0;
    }

	"(inlet1|outlet)"
	{
		type			calculated;
        value           $internalField;
	}


    "(movingObstacle|walls|inlet)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

	frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
