run/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          232;
        startFace       12532;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3184;
        startFace       12764;
    }
    overset
    {
        type            overset;
        nFaces          480;
        startFace       15948;
        faces           ( ( 6 28 29 7 ) ( 4 8 22 20 ) ( 12 26 28 6 ) ( 4 20 27 13 ) ( 7 29 30 14 ) ( 8 9 23 22 ) ( 14 30 31 15 ) ( 9 5 21 23 ) ( 11 15 31 25 ) ( 5 10 24 21 ) ( 10 11 25 24 ) ( 13 27 26 12 ) );
    }
    movingObstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       16428;
    }
)

// ************************************************************************* //
